{
  "intents": [
    {
      "tag": "introduction",
      "patterns": [
        "कहाँ है बनारस?",
        "बनारस के बारे में कुछ बताओ",
        "बनारस का परिचय क्या है?"
      ],
      "responses": [
        "बनारस, जिसे वाराणसी भी कहा जाता है, उत्तर प्रदेश राज्य का एक प्रमुख शहर है। यह शहर गंगा नदी के किनारे स्थित है और यह भारत के सबसे प्राचीन शहरों में से एक है।"
      ]
    },
    {
      "tag": "places_to_visit",
      "patterns": [
        "बनारस में घूमने लायक जगहें क्या हैं?",
        "बनारस में कौन-कौन सी जगहें देखी जा सकती हैं?",
        "बनारस में कौन-कौन सी प्रमुख स्थल हैं?"
      ],
      "responses": [
        "बनारस में घूमने के लिए कई प्रमुख जगहें हैं, जैसे कि काशी विश्वनाथ मंदिर, सारनाथ, दशाश्वमेध घाट, और रामनगर किला।"
      ]
    },
    {
      "tag": "food",
      "patterns": [
        "बनारस में कौन-कौन सा खाना प्रसिद्ध है?",
        "बनारस का कौन सा भोजन सबसे अच्छा है?",
        "बनारस में खाने के लिए क्या-क्या मिल सकता है?"
      ],
      "responses": [
        "बनारस में चाट, पांडा, और लस्सी जैसे प्रसिद्ध भोजन मिलते हैं। यहाँ की खास बात यह है कि यहाँ के भोजन में एक अलग ही स्वाद होता है।"
      ]
    },
    {
      "tag": "festivals",
      "patterns": [
        "बनारस में कौन-कौन से त्योहार मनाए जाते हैं?",
        "बनारस में सबसे बड़े त्योहार कौन से हैं?",
        "बनारस में साल में कौन-कौन से प्रमुख त्योहार होते हैं?"
      ],
      "responses": [
        "बनारस में गंगा महोत्सव, काशी चतुःषष्टि, और दिवाली जैसे प्रमुख त्योहार मनाए जाते हैं। यहाँ के त्योहार काफी प्रसिद्ध हैं और बहुत धूमधाम से मनाए जाते हैं।"
      ]
    },
    {
      "tag": "shopping",
      "patterns": [
        "बनारस में शॉपिंग के लिए कौन-कौन से बाजार हैं?",
        "बनारस में खरीदारी के लिए कहाँ जाना चाहिए?",
        "बनारस में कौन-कौन से बाजार अच्छे हैं?"
      ],
      "responses": [
        "बनारस में खरीदारी के लिए आप मदनपुरी, गोपालपुर, और तुलसी घाट जैसी जगहों पर जा सकते हैं। यहाँ की सिल्क साड़ियों के लिए बनारस बहुत प्रसिद्ध है।"
      ]
    },
    {
      "tag": "transportation",
      "patterns": [
        "बनारस में परिवहन के क्या विकल्प हैं?",
        "बनारस में ट्रांसपोर्ट कैसे मिलेगा?",
        "बनारस में यात्रा करने के तरीके क्या हैं?"
      ],
      "responses": [
        "बनारस में परिवहन के कई विकल्प हैं जैसे कि टैक्सी, ऑटो-रिक्शा, और सार्वजनिक बसें। आप गंगा नदी पर नाव की सवारी भी कर सकते हैं।"
      ]
    },
    {
      "tag": "accommodation",
      "patterns": [
        "बनारस में ठहरने के लिए कौन-कौन से होटल हैं?",
        "बनारस में अच्छा होटल कहाँ मिलेगा?",
        "बनारस में रुकने के लिए कौन-कौन से विकल्प हैं?"
      ],
      "responses": [
        "बनारस में ठहरने के लिए आप होटल रामनगर, होटल शाही और कई अन्य विकल्पों पर विचार कर सकते हैं। यहाँ पर विभिन्न बजट के होटल उपलब्ध हैं।"
      ]
    },
    {
      "tag": "history",
      "patterns": [
        "बनारस का इतिहास क्या है?",
        "बनारस की ऐतिहासिक महत्व क्या है?",
        "बनारस का पुराना इतिहास क्या है?"
      ],
      "responses": [
        "बनारस का इतिहास हजारों साल पुराना है। इसे 'काशी' भी कहा जाता है और यह हिन्दू धर्म के प्रमुख धार्मिक स्थलों में एक है। यहाँ की गंगा नदी के किनारे कई ऐतिहासिक घटनाएँ घटी हैं।"
      ]
    },
    {
      "tag": "temples",
      "patterns": [
        "बनारस में कौन-कौन से प्रमुख मंदिर हैं?",
        "बनारस के प्रमुख मंदिर कौन से हैं?",
        "बनारस में धार्मिक स्थलों की जानकारी दो"
      ],
      "responses": [
        "बनारस में काशी विश्वनाथ मंदिर, संकट मोचन हनुमान मंदिर और काष्ठ कुम्भ मेला जैसे प्रमुख मंदिर स्थित हैं। ये धार्मिक स्थल बहुत महत्वपूर्ण हैं।"
      ]
    },
    {
      "tag": "river",
      "patterns": [
        "गंगा नदी के बारे में बताओ",
        "बनारस में गंगा नदी के किनारे क्या देख सकते हैं?",
        "गंगा नदी का महत्व क्या है?"
      ],
      "responses": [
        "गंगा नदी बनारस की जीवन रेखा है। यहाँ पर गंगा आरती और अन्य धार्मिक अनुष्ठान होते हैं। नदी के किनारे कई घाट हैं जहाँ लोग स्नान करते हैं।"
      ]
    }
  ]
}
